//Задача 10. Патриций решил устроить праздник и для этого приготовил 240
//бочек вина.Однако к нему пробрался недоброжелатель, который подсыпал
//яд в одну из бочек.Недоброжелателя тут же поймали, дальнейшая его судьба
//неизвестна.Про яд известно, что человек, который его выпил, умирает в
//течение 24 часов.До праздника осталось два дня, то есть 48 часов.У
//патриция есть пять рабов, которыми он готов пожертвовать, чтобы узнать, в
//какой именно бочке яд.Каким образом можно это узнать ?
//Выполнил Коновалюк М.А.
#include "../../Laba7/MyFuckingString/MyFuckingString.cpp"
#include <iostream>

int main()
{
	my_str Laba = "Vadim ";
	std::cout << Laba * 1000000;

	return 0;
}
